/*1.14. Тіло починає рухатися без початкової швидкості з прискоренням а.
Обчислити: відстань, яку воно пройде за час t від початку руху та
час, за який тіло досягне швидкості v.*/

// v = a*t >> t = v/a
// s = (a*t^2)/2
#include <stdio.h>

int main()
{
    float a1; // прискорення в першій частині задачі
    float t1; // час в першій частині задачі
    float a2; // прискорення в другій частині задачі
    float v;  // швидкість в другій частині задачі
    printf("Перша частина задачі\n"
           "Обчислення відстані за заданим часом і прискоренням\n"
           "Введіть прискорення тіла (у м/с^2):\n");
    scanf("%f", &a1);
    printf("Введіть час, протягом якого тривав рух тіла (у с):\n");
    scanf("%f", &t1);
    float s = (a1 * t1 * t1) / 2;
    printf("Відстань, яку пройшло тіло за час %.2f секунд від початку руху з прискоренням %.2f м/с^2: %.2f м\n", t1, a1, s);
    printf("Друга частина задачі\nОбчислення часу, за який тіло досягне швидкості v за відомим прискоренням та швидкістю\nВведіть прискорення тіла (у м/с^2):\n");
    scanf("%f", &a2);
    printf("Введіть швидкість, яку тіло має досягти протягом руху (у м/с):\n");
    scanf("%f", &v);
    float t2 = v / a2;
    printf("Тіло, яке рухається без початкової швидкості з прискоренням %.2f м/с^2 досягне швидкості %.2f м/с за час %.2f с", a2, v, t2);
}