/* Середнє арифметичне, середнє геометричне та сума послідовності ненульових цілих чисел */

#include <stdio.h>
#include <math.h>

int main()
{
    printf("З наступного рядка починайте вводити ненульові цілі числа. Після введення числа 0 ввід припиниться.\n");
    int i = 1;
    int number = 0;
    int flag = 0;
    double sum = 0., ariphm = 0., geo = 0., prod = 1.;
    while (1)
    {
        printf("a[%d]=", number);
        scanf("%d", &i);
        sum += i;
        if (i < 0)
        {
            flag = 1; // якщо є від'ємні, то середнє геометричне не обчислюємо
        }
        if (i == 0)
        {
            break;
        }
        ariphm = sum / (number + 1);
        prod *= i;
        number++;
    }
    if (flag == 0)
    {

        geo = pow(prod, 1. / number);
        printf("Сума введених чисел: %lf\n"
               "Середнє арифметичне введених чисел: %lf\n"
               "Середнє геометричне введених чисел: %lf",
               sum, ariphm, geo);
    }
    else if (flag == 1)
    {
        printf("Сума введених чисел: %lf\n"
               "Середнє арифметичне введених чисел: %lf\n"
               "Середнє геометричне введених чисел обчислити неможливо, оскільки серед введених чисел є від'ємні.",
               sum, ariphm, geo);
    }
}