/* Обчислення субфакторіала */

/* Скористаємось рекурсивною формулою для субфакторіала:
Для n<2 виконуються такі рівності
!0 = 1
!1 = 0

Для n>=2 -- !n = !(n-1) * n + (-1)^n
*/

#include <stdio.h>

int subfactorial(unsigned n)
{
    if (n < 2)
    {
        return 1 - n;
    }
    return subfactorial(n - 1) * n + (n % 2 == 0 ? 1 : -1); // застосовуємо рекурсивний виклик функції і тернарний оператор для обчислення (-1)^n
}

int main()
{
    unsigned n;
    printf("Введіть натуральне число n < 25:\n");
    scanf("%u", &n);
    printf("!%u = %u", n, subfactorial(n));
}