/*2.2. Обчислити площу трикутника S за трьома сторонами a, b, c*/

#include <stdio.h>
#include <math.h>

int main()
{
    float a, b, c;
    printf("Введіть першу сторону трикутника a: \n");
    scanf("%f", &a);
    printf("Введіть першу сторону трикутника b: \n");
    scanf("%f", &b);
    printf("Введіть першу сторону трикутника c: \n");
    scanf("%f", &c);
    float p = (a + b + c) / 2;                       // ініціалізуємо змінну півпериметра
    float S = sqrt(p * (p - a) * (p - b) * (p - c)); // обчислюємо площу трикутника за формулою Герона
    printf("Площа трикутника зі сторонами a = %.2f, b = %.2f, c = %.2f дорівнює %.2f", a, b, c, S);
}