/* 2.8 а) Обчислення медіан трикутника за його сторонами */

#include <stdio.h>
#include <math.h>

int main()
{
    double a, b, c;
    printf("Введіть довжину сторони трикутника а:\n");
    scanf("%lf", &a);
    printf("Введіть довжину сторони трикутника b:\n");
    scanf("%lf", &b);
    printf("Введіть довжину сторони трикутника c:\n");
    scanf("%lf", &c);

    double m_a = sqrt((2 * b * b + 2 * c * c - a * a) / 4);
    double m_b = sqrt((2 * a * a + 2 * c * c - b * b) / 4);
    double m_c = sqrt((2 * b * b + 2 * a * a - c * c) / 4);

    printf("Довжина медіани, проведеної до сторони трикутника a = %.2lf дорівнює %.2lf\n", a, m_a);
    printf("Довжина медіани, проведеної до сторони трикутника b = %.2lf дорівнює %.2lf\n", b, m_b);
    printf("Довжина медіани, проведеної до сторони трикутника c = %.2lf дорівнює %.2lf\n", c, m_c);
}