/*3.1. Введіть три цілих числа, записаних через кому в одному рядку
та підрахуйте їх добуток, якщо всі ці числа гарантовано по модулю менші за
a) 2^10
б) 2^21 */

#include <stdio.h>

int main()
{
    int a1, b1, c1;
    printf("Введіть три цілих числа через кому, менших по модулю 2^10:\n");
    scanf("%d,%d,%d", &a1, &b1, &c1);
    int product1 = a1 * b1 * c1;
    long long int a2, b2, c2;
    printf("Введіть три цілих числа через кому, менших по модулю 2^21:\n");
    scanf("%lld,%lld,%lld", &a2, &b2, &c2);
    long long int product2 = a2 * b2 * c2;
    printf("а) Добуток введених чисел: %d\n", product1);
    printf("б) Добуток введених чисел: %lld\n", product2);
}
